[{"username": "robbiet480", "parent_id": 0, "article_id": null, "id": "5999686", "comment": "(latest info at bottom of comment)\n\nABC reports it was coming from Taipei, linked forum says Taipei. Video of aftermath. https://www.youtube.com/watch?v=0dFtmSybpuw&feature=youtu.be.\n\nRedwood City FD responding. Unknown amount of passengers. SFO FD using foam on entire plane.\n\nFAA has now shut down operations at SFO due to \"disabled plane\"\n\n3rd alarm called, \"red\" alarm called.\n\nMultiple reports that fuselage is in multiple pieces. Tail is some yards away.\n\nFAA issues statement: \"A Boeing 777 operated by Asiana Airlines crashed while landing at San Francisco International Airport.\" No further details.\n\nAsiana Airlines flight OZ214, Boeing 777, registration HL7742 http://t.co/bSgoVeggrU\n\nBetter picture: pic.twitter.com/JqLj9OAtzv\n\n#SFOFire Northfield IC, North Field Command, four engines and 3 ambulances inbound to aircraft, other units staging #CaFire\n\n@rafweverbergh: Confirmed with controller at SFO: \"plane is broken in multiple pieces. (...) a hard landing\" SOURCE: http://t.co/ghqoLpxfVM @scobleizer [http://twitter.com/rafweverbergh/status/353590307402694658]\n\n@CarrieMantha: Thank God @OntarioHazards EMS reporting all passengers of the downed plane at #SFO are accounted for. Injuries but no reports of fatalities [http://twitter.com/CarrieMantha/status/353590343624691712]\n\n@punkboyinsf: Redwood City Fire is classifying SFO plane crash as 3 alarm fire and level 8 mass casualty incident. via @lautenbach #YAL [http://twitter.com/punkboyinsf/status/353590933515804672]\n\n@Emergency_In_SF: SFO AIR CRASH (update): crews report 48 patients have been rescued so far after 777 crashes on landing. Passengers still on burning plane [http://twitter.com/Emergency_In_SF/status/353591197144588288]\n\nLIVE SHOT OF PLANE NOW AVAILABLE:\n\n@brianstelter: KTVU, Fox affiliate in San Fran, has a faraway live shot of the plane here: http://t.co/BXreHtWugm No anchored coverage yet. [http://twitter.com/brianstelter/status/353591320733941760]\n\nSomeone got a picture of the crash as it happened:\n\n@stefanielaine: just realized I have a picture of the actual crash. holy fucking shit. http://t.co/5TnOX96Gsi [http://twitter.com/stefanielaine/status/353591123958173696]\n\n@peterpham: 290 passengers on plane, 1 infant -  San Francisco Fire and EMS Live Audio Feed http://t.co/ZoMhufPNMA via @Broadcastify [http://twitter.com/peterpham/status/353592842385494016]\n\nVERY UP CLOSE PICTURE FROM TWITTER: https://path.com/p/1lwrZb"}, {"username": "MattRogish", "parent_id": "5999686", "article_id": null, "id": "6000563", "comment": "AVHerald.com report, which will be kept updated and also will eventually get NTSB reports:\n\nhttp://avherald.com/h?article=464ef64f&opt=0"}, {"username": "bsg75", "parent_id": "5999686", "article_id": null, "id": "5999835", "comment": "Amazing changes in information [1] flow. HN becomes a better source than all major networks combined.\n\n[1] *Information as contrasted to conjecture and dramatization.*"}, {"username": "frankydp", "parent_id": "5999835", "article_id": null, "id": "5999887", "comment": "KTVU is providing amazingly sensationalist coverage.  I guess I do not watch enough video news to be use to seeing it.  Just wild assumptions and implied details."}, {"username": "bsg75", "parent_id": "5999887", "article_id": null, "id": "5999913", "comment": "Apparently the belief is if they don't talk constantly, the reality TV demographic (those influenced by commercials) won't watch. Actual information is not important, just dramatic syllables.\n\nAmazingly, Fox News is broadcasting a live feed of the scene, with no more audio than the helicopter itself: http://video.foxnews.com/v/1155606219001/"}, {"username": "speeder", "parent_id": "5999913", "article_id": null, "id": "6000085", "comment": "When 9/11 happened here, the biggest news network here had the reporters do that, they kept talking random shit...\n\nIt was kinda funny (despite the seriousness of the situation), when they were already full blasting the flight regulations and pilots on how irresponsible they were, when the second plane (that crashed on the second tower) entered the screen, and the anchor (that is the most famous anchor in Brazil) went: \"LOOK AT HOW LOW THEY FLY, THAT IS...\" and the plane crashes on the tower, and the reporter clearly go on full-confused mode, specially because it probably downed to him that he was speaking shit until now."}, {"username": "ericcumbee", "parent_id": "5999913", "article_id": null, "id": "6000423", "comment": "Check the lower third on CNN \"Fire Chief: Fire Fighters went to work right away\" I mean really? they did not stop for some in and out on the way to the scene?"}, {"username": "JshWright", "parent_id": "6000423", "article_id": null, "id": "6000519", "comment": "One of my favorite CNN quotes from the day: \"Video taken soon after the crash and posted on YouTube showed dark gray smoke rising from the plane, which appeared to be upright. That smoke later became white, even as fire crews continued to douse the plane.\"\n\nUh... that's what happens when you put water on fire... you get steam, which condenses into white clouds.\n\nThat's a basic rule of firefighting... black bad, white good (and when it comes to structural firefighting, brown really bad)."}, {"username": "jasonmccay", "parent_id": "5999887", "article_id": null, "id": "6000005", "comment": "KTVU is borderline comical ... they were making wild assumptions that, even using basic logic and common sense, could be dismissed. I was really surprised how unknowledgeable they seemed.\n\nMuch better to just report what you know and not try to make up information (even just claiming it as conjecture). Online sources were far more valuable."}, {"username": "david_shaw", "parent_id": "6000005", "article_id": null, "id": "6000451", "comment": "*> they were making wild assumptions that, even using basic logic and common sense*\n\nAgreed. I changed the channel (well, found a new live stream) when they said \"it's likely that all or most of the passengers died\" *immediately* after showing the photograph from the scene, showing many passengers leaving.\n\nThe caption to the photo was \"I'm fine, and everyone else seems fine.\"\n\nReally, KTVU?"}, {"username": "paul_f", "parent_id": "6000451", "article_id": null, "id": "6000545", "comment": "KTVU was so bad that I had to take a screenshot of their website. A photo showed people walking away from an upright plane with the copy \"after wobbling for a minute, the aircraft flipped upside down, coming to a stop on runway upside down.\"\nhttps://twitter.com/pfreet/status/353599929039589376/photo/1\n\nThe death of journalism indeed."}, {"username": "qpoo", "parent_id": "5999887", "article_id": null, "id": "5999934", "comment": "Sensational it is sure. They have a helicopter circling around , while hacker news does not. But besides that, they can even interview drivers on highway 101, passengers on the next plane, how relevant! Oh, they did show the twitter picture by @eunner, yeah, they get it! They were reporting like that pretty much 10 years ago.\nAs a side note, a koreatimes article about B777 incidents recently: (B777 engine failure sparks concerns) http://www.koreatimes.co.kr/www/news/nation/2013/07/116_138693.html\n\n'... On July 2, the jet, bound for Incheon International Airport from Chicago with 273 passengers on board, made the emergency landing at a far eastern Russian airport after only seven hours of flight.\n...\nAfter engineers of Korean Air replaced the malfunctioned left engine, Koreaâ\u0080\u0099s Ministry of Land, Infrastructure and Transport and the carrier launched an investigation into the incident and found the gearbox in the engine, built by General Electric (GE), was the reason for the problem.\n...'"}, {"username": "callmeed", "parent_id": "5999835", "article_id": null, "id": "6000197", "comment": "I've had CNN on for a while and it's amazing how little information they are giving. Until I came here i didn't know if there were 2 dead or 200 dead. It's almost as if they are so concerned with being wrong about anything that they can't offer any sort of initial report, rumor, or conjecture."}, {"username": "senorprogrammer", "parent_id": "6000197", "article_id": null, "id": "6000228", "comment": "Almost as they they're trying to report rather than spread \"rumor, or conjecture\"? If that's the case they deserve applause; it'd be nice to see news agencies back on the reporting track, analysing and filtering before going on-air."}, {"username": "untog", "parent_id": "6000197", "article_id": null, "id": "6000288", "comment": "Call me old fashioned, but I'd prefer if the rumour and conjecture stayed on Twitter."}, {"username": "jcdavis", "parent_id": "5999686", "article_id": null, "id": "5999703", "comment": "The flight was Asiana 214 from Seoul: http://flightaware.com/live/flight/AAR214"}, {"username": "jkimmel", "parent_id": "5999686", "article_id": null, "id": "5999833", "comment": "I wish I could find a well compiled list of facts & sources like this along with every news article. Great work, thanks for sharing."}, {"username": "spullara", "parent_id": "5999833", "article_id": null, "id": "5999980", "comment": "Wikipedia usually has the info for major events."}, {"username": "rdhyee", "parent_id": "5999980", "article_id": null, "id": "6000061", "comment": "At the moment, the most info on the crash on the Wikipedia seems to be at http://en.wikipedia.org/wiki/Asiana_Airlines_Flight_214"}, {"username": "austenallred", "parent_id": "5999686", "article_id": null, "id": "6000054", "comment": "They're now saying 2 are dead, 61 injured\n\nEDIT: They = KTVU News"}, {"username": "austenallred", "parent_id": "6000054", "article_id": null, "id": "6000402", "comment": "Now saying 60 people unaccounted for."}, {"username": "austenallred", "parent_id": "6000402", "article_id": null, "id": "6000696", "comment": "And now all but 1 accounted for."}, {"username": "codecomplete", "parent_id": "5999686", "article_id": null, "id": "6000122", "comment": "Audio from air traffic controller during crash http://l.bitcasa.com/BAhtheeZ"}, {"username": "austenallred", "parent_id": "5999686", "article_id": null, "id": "5999797", "comment": "Awesome reporting! Seriously, good job.\n\nI honestly believe that a collection of sources like this is the future of news; allow people to draw their own conclusions based on the first-hand content you can collect.\n\nShameless plug: OK, that's actually what I've been building for a few months. We had to break it to finish building it (sorry, or i'd just show you), but our launchrock page is at http://grasswire.com if you want to have access when we launch"}, {"username": "shock-value", "parent_id": "5999797", "article_id": null, "id": "5999989", "comment": "I don't think it's appropriate to be hawking your product in the midst of a (potential) tragedy. This is nothing to be excited over."}, {"username": "austenallred", "parent_id": "5999989", "article_id": null, "id": "6000298", "comment": "Saying that I'm \"excited\" about a tragedy (I'll remove the word \"potential\" as so far at least two people have died) is unfair. You make it seem like I'm getting stoked that a plane crashed.\n\nI'm not trying to \"hawk\" anything, but am trying to help create a system that will help people understand the world around them in a better, more efficient way. If linking to it in this thread feels cheap then I apologize, but that wasn't the intent at all."}, {"username": "shock-value", "parent_id": "6000298", "article_id": null, "id": "6000312", "comment": "Edit: scratch the original response here, I mixed your username up with another user's reply. Sorry about that. I still feel you shouldn't be promoting your website/news service in this thread, however."}, {"username": "austenallred", "parent_id": "6000312", "article_id": null, "id": "6000332", "comment": "Edit: Former comment retracted. I still disagree, but it's not worth discussing here. Carry on."}, {"username": "elliottcarlson", "parent_id": "5999797", "article_id": null, "id": "6000064", "comment": "The problem is when you have reports stating that the plane flipped over when that clearly did not happen. Crowd sourced news will not always be accurate, and can also lead to crowd based vigilantism such as happened during the Boston attack and the aftermath on Reddit.\n\nWhile traditional media often relies on sensationalism and also use these same sources of information during broadcast, this is not an ideal method either."}, {"username": "austenallred", "parent_id": "6000064", "article_id": null, "id": "6000087", "comment": "That's why you have to build fact-checking in. Reports did say the plane flipped over, but there were pictures on Twitter showing it clearly didn't. If you were shown both of those reports at the same time it would be obvious what the right answer is.\n\nAlso, it's worth noting that mainstream media was reporting the plane had flipped over as well, so misinformation isn't solved by the current solutions."}, {"username": "untog", "parent_id": "5999797", "article_id": null, "id": "5999831", "comment": "I'm not sure I agree. From those first pictures I saw (charred plane) I drew my own conclusion that a large number of people must have died. From the latest reports, it appears I was wrong.\n\nSometimes we don't know enough to make meaningful conclusions without experts weighing in. Not to mention bias- first hand accounts are rarely impartial. In this instance there aren't any \"sides\" to take, but I'd bet that most of the photos flowing out of Egypt right now have an opinion behind them."}, {"username": "austenallred", "parent_id": "5999831", "article_id": null, "id": "5999854", "comment": "That's fair, but I think I still disagree. If you are only looking at one source, sure, it can be confusing, but if you have a good collection of all of the first-hand sources really you are able to draw the same conclusion that any reporter might be able to. Right now we have basically outsourced the job of drawing conclusions from opinionated people to reporters. Given the right information I believe every person could do that.\n\nBut I recognize that's not a belief held by many people. I've just been able to watch all of the reports come in for a while and feel like that's enough, if not better."}, {"username": "anigbrowl", "parent_id": "5999854", "article_id": null, "id": "6000195", "comment": "*we have basically outsourced the job of drawing conclusions from opinionated people to reporters*\n\nYes, and this is economically efficient. Of course they get all sorts of things wrong at the outset - the fact that this is annoying is a reflection of how much we rely on them. But the fact is that in most cases we don't especially need to know these things immediately; I'm curious about this crash, of course, but it doesn't affect me directly and there's nothing I can do about it. It's actually better that I didn't check the news until a bit later in the day when some time had gone by and the details had firmed up - I'm a little behind the curve, but I've saved 2 hours of pointless and probably poorly-founded speculation. If it wasn't for the fact that my wife watches more TV than I do I'd probably go days at a time without checking, and just catch up Saturdays when the *Economist* arrives.\n\nI understand being a news junkie - because I am one. But it's an unhealthy habit that rarely yields enough advantage to justify the time involved. I'll check out your startup but really, I suspect it would just be an endless time sink for me. I already find this a big problem with text-based news.\n\nEDIT: I meant to say internet-based news.\n\nTo answer the reply below, I guess my question is 'what benefit is there to me in following multiple reports as they break? To be good at it requires doing it on a regular basis, but the economic benefit is questionable. I think it's a great idea, and if it can build up a sufficient community then it has the potential to function as a better news bureau than existing sources. The hurdle to climb is that the number of people who will be both skilled at analyzing breaking news events and have the time to put in regularly will be fairly small, and every time there's a major event the interested local population that joins in will consist largely of -first timers, whose contributions will amount to (Shannon) noise.\n\nI mention a local event, because I see that while we're worried about this because many HNers are in the Bay Area, over on the East Coast near Maine a train carrying oil derailed and exploded in the middle of a small town, flattening the town center and with 60-100 people missing. So a plane crash with only two fatalities doesn't seem very important from a different perspective."}, {"username": "austenallred", "parent_id": "6000195", "article_id": null, "id": "6000306", "comment": "What I'm saying is that if you could use the aggregate  cognitive surplus of the people trying to follow the event as it breaks, you could use that to create something cohesive and reliable. Then if you're not a news junkie and don't have any interest in following a story until it has settled down, you're welcome to do so.\n\n[edit] In response to the question above: So is your question why would somebody follow something as it breaks?"}, {"username": "anigbrowl", "parent_id": "6000306", "article_id": null, "id": "6000456", "comment": "It's not so much why do we follow something as it breaks - that's normal human curiosity/pattern hunger. But my question is how many people will do it consistently enough to be neutral, rather than because they're selectively interested in (but not necessarily informed about) a small set of stories. As I understand it this has been the problem for Wikinews - it can't function as well as Wikipedia because the number of people is below a critical threshold, so it lags breaking news by up to several days."}, {"username": "austenallred", "parent_id": "6000456", "article_id": null, "id": "6000491", "comment": "That's an excellent question. Wikinews doesn't function as well, in my opinion, because Wikinews feels like work - the people I've talked to that use/create Wikinews say they do it out of a sense of civic responsibility; it's not enjoyable, and a lot of the time they say it feels like rewriting the New York Times (from the couple dozen I've talked to).\n\nThe solution, I think, is in making following the news as it breaks exciting/interesting enough the average person would contribute. Our solution for that was to show you all of the social media streaming from different sources streaming in real time related to the event, making it more like /r/new (Reddit) than wikinews. Watching everything stream in and sorting out the good stuff is exciting; it's easy to get a lot of neutral eyeballs on it."}, {"username": "untog", "parent_id": "5999854", "article_id": null, "id": "5999867", "comment": "*If you are only looking at one source, sure, it can be confusing, but if you have a good collection of all of the first-hand sources really you are able to draw the same conclusion that any reporter might be able to.*\n\nNot if you were a reporter on the ground. If you have multiple biased sources you can't get an unbiased view without squinting and inferring things you don't know.\n\nI don't disagree that with the \"right\" information, people can make good conclusions. I just think that it's very rare for the \"right\" information to be available. This is an example of where it's more likely, as there is no \"pro-crash\" story to tell. That isn't the case with almost any politically sensitive story, though."}, {"username": "andrewlowell", "parent_id": "5999831", "article_id": null, "id": "5999858", "comment": "It's true that our first hastily-drawn conclusions from not enough facts are mostly wrong, but I will say this: it's fascinating and for me, thrilling, to watch the truth about big events coalesce in real time as primary, grassroots-sources get compiled (and fact-checked!)."}, {"username": "sethbannon", "parent_id": 0, "article_id": null, "id": "5999748", "comment": "Someone who was on the plane says everyone seems OK: https://path.com/p/1lwrZb"}, {"username": "jka", "parent_id": "5999748", "article_id": null, "id": "5999905", "comment": "Sincerely hope so - it may be a little early to tell though, he likely didn't have visibility of the full cabin and it's hard to tell what things are like inside."}, {"username": "ewang1", "parent_id": "5999905", "article_id": null, "id": "6000044", "comment": "That's David Eun, a Samsung exec, so he was probably up front in biz class."}, {"username": "dnautics", "parent_id": "6000044", "article_id": null, "id": "6000528", "comment": "the front section of the plane is theoretically the most dangerous part of the plane; survivors in plane crashes are most likely to come from just behind the wing."}, {"username": "Retric", "parent_id": "6000528", "article_id": null, "id": "6000842", "comment": "That greatly depends on the type of crash.  The added risk your talking about has a lot to do with nose down collisions."}, {"username": "untog", "parent_id": "5999748", "article_id": null, "id": "6000033", "comment": "Look as though there are very variable reports right now- some saying two dead, at the very least a good number are injured."}, {"username": "InclinedPlane", "parent_id": "6000033", "article_id": null, "id": "6000200", "comment": "Probably a simple logical fallacy. The dead aren't going to walk off a plane, so if you look around yourself after evacuating a plane and don't see anyone dead you might say that everyone seemed to be ok."}, {"username": "danso", "parent_id": 0, "article_id": null, "id": "5999752", "comment": "A tweet from a purported passenger:\nhttps://twitter.com/Eunner/status/353592664526028801\n\n> I just crash landed at SFO. Tail ripped off. Most everyone seems fine. I'm ok. Surreal... (at @flySFO) [pic] â\u0080\u0094 https://path.com/p/1lwrZb"}, {"username": "jcdavis", "parent_id": 0, "article_id": null, "id": "5999879", "comment": "ATC audio from the crash http://wandr.me/Audio/AAR214-KSFO-Crash.mp3"}, {"username": "ceejayoz", "parent_id": "5999879", "article_id": null, "id": "5999916", "comment": "I know they train for it, but the coolheaded professionalism there is remarkable - tower, other planes, all of them."}, {"username": "InclinedPlane", "parent_id": "5999916", "article_id": null, "id": "6000134", "comment": "That's why airlines like to get pilots with military experience. They are exposed to more crazy scenarios in training and work and generally keep a cool head better under stress."}, {"username": "maxcan", "parent_id": "5999916", "article_id": null, "id": "6000486", "comment": "ATC operators must be the most underrated people in our transportation system."}, {"username": "jlgaddis", "parent_id": "5999916", "article_id": null, "id": "6000046", "comment": "Agreed. It was like it didn't even phase the controller. Wow."}, {"username": "robbiemitchell", "parent_id": "5999879", "article_id": null, "id": "5999998", "comment": "Amazing. Wish I understood what's happening in each exchange."}, {"username": "8ig8", "parent_id": "5999998", "article_id": null, "id": "6000861", "comment": "I found these comments helpful. They breakdown the exchange between the tower and the approaching planes. The first is from an air traffic controller.\n\nhttp://www.reddit.com/r/worldnews/comments/1hrewx/asiana_airlines_boeing_777_has_crashed_at_the_san/cax80de\n\nhttp://www.reddit.com/r/worldnews/comments/1hrewx/asiana_airlines_boeing_777_has_crashed_at_the_san/cax7r3t"}, {"username": "tdenkinger", "parent_id": "5999998", "article_id": null, "id": "6000218", "comment": "Basically, the United flight holds short of runway 28 as he may need a little more time (this is the United flight CNN showed sitting there, probably).\n\nThe ATC controller knows something has happened because the first time we hear from 214 heavy, the controller tells the pilot emergency vehicles are on the way.\n\nThen some captains on final announce they're going around and some ask for redirect (one clearly to San Jose). The controller then tells some flights on final to go around.\n\nFinally he's directing rescue units to cross all runways where normally they'd hold at each runway to be directed."}, {"username": "rapsourly", "parent_id": "5999879", "article_id": null, "id": "6000077", "comment": "Is there a transcript available?"}, {"username": "Stratoscope", "parent_id": "6000077", "article_id": null, "id": "6000439", "comment": "I transcribed part of it:\n\n0:00-0:02 - Tower: \"Asiana 214, San Francisco Tower, runway 28 left, cleared to land\"\n\n0:02-0:04 - Asiana 214 pilot: \"Cleared to land left, Asiana 214\"\n\n0:05-0:08 - Tower: \"Skywest 5427, fly runway heading and contact (north cal?) departure\" (plane took off and is making a straight-out departure, and now will contact departure control)\n\n0:09-0:12 - Skywest 5427 pilot: \"OK, going to departure, Skywest 5427 (free?)\"\n\n0:12-0:14 United 885 pilot: \"United 885\" (pilot makes a quick break call to tower before making a longer request)\n\n0:14-0:16 Tower: \"United, uh, 85, OK?\" (tells pilot to go ahead)\n\n0:17-0:21 United 885 pilot: \"Yes, United 885 at the end, we might need a few more minutes, just a heads-up\" (It sounds like 885 is next for takeoff and has taxied into position next to the runway)\n\n0:21-0:25 Tower: \"United 885, roger, hold short of runway 28 left, let me know when you're ready\"\n\n0:25-0:27 United 885 pilot: \"Hold at 28 left, United 885\"\n\n0:27-0:32 Skywest 5452 pilot: \"San Francisco Tower, Skywest 5452, (quite ?), 28 right\"\n\n0:32-0:36 Tower: \"Skywest 5452, San Francisco Tower, runway 28 right, cleared to land\"\n\n0:36-0:38 Skywest 5452 pilot: \"Clear to land, 28 right, Skywest 5452\"\n\n0:38-0:41 Tower: \"Three Sierra Fox... (garbled)\"\n\n0:39-0:41 Voice in background (in tower?) \"What? Hell? What happened?\"\n\n0:43-0:50  Skyhawk 737ZD pilot:  \"San Francisco Tower, Skyhawk seven three seven zulu delta (garbled, another transmission saying 'GO AROUND') (something) plus 500 feet please, over San Carlos\" (A four seat Cessna is over the San Carlos airport just southeast of SFO and wants to cross the SFO airspace. 737ZD [if I have it right] is the aircraft's tail number, no connection to the Boeing 737.)\n\n0:50-0:52 Tower: \"Skyhawk 6389, maintain 3000 [feet altitude]\" (It sounds like 6389 is on approach to land and tower is telling him to go around? Not sure)\n\n0:53-0:54 Skyhawk 6389 pilot: \"(something) 3000, yes, 389\" (speaking quickly to keep the channel clear)\n\n0:55-0:57 Asiana 214 pilot (!!): \"Tower, Asiana 214!\"\n\n0:57-1:00 Tower: \"Asiana 214 heavy, emergency vehicles are responding\" (\"heavy\" refers to any large aircraft)\n\n1:00-1:01 Asiana 214 pilot: \"214\" (acknowledging)\n\n1:02-1:03 Tower? \"Emergency veh(something)\"\n\n1:03-1:09 Asiana 214 pilot: \"OK, now, uh, uh, and ten or twelve (?) (unintelligible)\"\n\n1:10-1:16 Tower: \"Cessna 737 Zulu Delta, San Francisco Tower, remain clear of the San Francisco (Fox Bravo?) airspace, contact San Carlos Tower\"\n\n1:17-1:21 Skyhawk 737ZD pilot: \"Seven Zulu Delta, contacting San Carlos Tower, and remaining clear\"\n\nThere's another minute or so on the recording, but my nerves are shot after doing that much. If anyone would like to pick it up from there, correct it, etc., please do."}, {"username": "haldujai", "parent_id": "6000439", "article_id": null, "id": "6000648", "comment": "I did my best.\n\n1:10 ATC: 737 Zulu Delta San Francisco Tower, remain clear of the San Francisco Fox Bravo airspace [ed: I believe Bravo refers to the SF Class B airspace, not sure what the Fox is]. Contact San Carlos Tower\n\n1:17 737 Zulu Delta Pilot: Contacting San Carlos Tower and remaining clear.\n\n1:22 ATC: 305 start leaving the Bravo airspace and 2 miles .. terminate ... maintain the appropriate stage ..\n\n1:27 ATC: (inaudible) is closed San Francisco Tower (inaudible)\n\n(inaudible command to Horizon 635 from ATC)\n\n1:34 ATC: He's got a 214 heavy, San Francisco Tower\n\n1:37 ATC: Asiana (inaudible)\n\n1:42 635 Pilot: 635 going around.\n\n143 ATC: 635 fly heading 2-6-5 maintain 3100 (ft).\n\n1:46 635 Pilot: 265 3100 - alright 635.\n\nAsiana (inaudible)\n\n1:51 ATC: Asiana 214 heavy emergency vehicles are responding, we have everyone on their way\n\n1:57 ATC: SkyWest 5452 san francisco tower go around\n\n2:00 SkyWest 5452: Go around Skywards 5452\n\n2:03 ATC: SkyWest 5452 fly heading 2-8-0 maintain 3000 ft.\n\n2:07 SkyWest 5452 Pilot: 280 and 3000, SkyWest 5452.\n\n2:10 Horizon 635 fly heading 2-6-5 maintain 3100\n\n2:13 635 Pilot: Yes sir 265 3100, Horizon 635\n\n2:16 ATC: Contact NORCAL reports for 135.1\n\n2:19 635 Pilot: 35.1 - Horizon 635\n\n2:22 SkyWest 5452 contact NORCAL reports for 135.1\n\n2:25 5452 Pilot: 35.1\n\n2:27 6039 Pilot: 6039 will go to San Jose\n\n2:31 ATC: SkyWest 6039 roger. Contact NORCAL for departure\n\n2:35 ATC: (inaudible) SkyWest 6389\n\n2:39 ATC: rescue 33 San Francisco tower proceed to the scene cross - inaudible -  the 11 San Francisco Tower proceed as requested. Cross all runways.\n\n2:46 Rescue: San Francisco Tower 33 and rescue 11 cleared the 1.\n\n2:50 ATC: rescue 33, rescue 11 roger.\n\n2:54 ATC: (inaudible) Foxtrot San Francisco Tower\n\nEND.\n\nI also listened to the ATC before descent, no talk about any failures or problems or requests for rescue before descent."}, {"username": "waster", "parent_id": "6000648", "article_id": null, "id": "6000689", "comment": "Edit: I was transcribing this when you were, apparently; but here's mine, in case we caught different things.\n\n1:23 Tower: tells a departing helicopter to depart 2 mi straight out, turn right, squawk a certain signifier on its altimeter (standard practice), and approves a frequency change (also standard practice);\n\n1:28 Tower: cuts out briefly and then says \"..is closed, San Francisco Tower.\"\n\n1:31 Tower: silence, then starts to tell a Horizon flight something and the Asiana pilot cuts in with [hard to hear, best guess]\"San Francisco?\" Also, Sounds to me like they put Asiana 214 on a priority channel over other flight traffic, or that the tower cut itself/other pilots off when they saw/heard Asiana 214 was speaking.\n\n1:36 Tower: Asiana 214 Heavy, San Francisco Tower\n\n1:37 Asiana 214: [unintelligible, but my best guess: This, uh..., how much is this, uh, where is, uh,... uh,...\"]\n\n1:42 Horizon 635: 635 is going around\n\n1:43 Tower: Horizon 635, fly heading 265, maintain 3100\n\n1:46 Horizon 635: 265, 3100, Horizon 635\n\n1:49: Asiana 214 [garbled]: San Francisco?\n\n1:52 Tower: Asiana 214 Heavy, emergency vehicles are responding; they have everyone on their way.\n\n1:56 Asiana 214: [garbled, definitely a few words and then a static burst]\n\n1:58 Tower: Skywest 5452, San Francisco Tower, go around.\n\n2:00 Skywest 5452: Go around, Skywest 5452\n\n2:30 Tower: Skywest 5452, fly heading 280, maintain 3000.\n\n2:07 Skywest 5452: 280 at 3000, Skywest 5452\n\n2:10 Tower: Horizon 635, fly heading 265, maintain 3100.\n\n2:14 Horizon 635: Yessir, 265, 3100, Horizon 635.\n\n2:17 Tower: Contract North Cal departure 135.1.\n\n2:19 Horizon 635: 35.1, Horizon 635.\n\n2:22 Tower: Skywest 5452, contact North Cal departure 135.1.\n\n2:26 Skywest 5452: 35 1.\n\n2:28 Skywest 6389: 6389 We'll go to San Jose.\n\n2:30 Tower: Skywest 6389, Roger. And, uh, contact North Cal departure.\n\n2:34 Skywest 6389 [garbled]: What's the... frequency for that?\n\n2:36 Tower [garbled at start]: [garbled] point 1, Skywest 6389.\n\n2:39 Tower [garbled at start]: Rescue three three, San Francisco Tower, proceed to the scene, cross runway; [garbled, maybe \"Rescue\"] eleven, San Francisco Tower, proceed as requested, cross all [garbled, \"runways\"?]\n\n2:46 Rescue 11: San Francisco Tower, [garbled, maybe \"Rescue 33\"] and Rescue 11, cleared to one.\n\n2:50 Tower: Rescue 33, Rescue 11, roger.\n\n2:54 Tower: [garbled] Foxtrot, San Francisco Tower\n\n[end transcript]"}, {"username": "jzwinck", "parent_id": "6000648", "article_id": null, "id": "6000767", "comment": "Your \"6039\" should be \"6389\".  It was only clearly audible the last time on the tape, the previous couple times it did sound like 6039 due to interference."}, {"username": "waster", "parent_id": "6000648", "article_id": null, "id": "6000692", "comment": "Apparently I was doing this simultaneously with you; oops."}, {"username": "paul_f", "parent_id": "6000439", "article_id": null, "id": "6000557", "comment": "Thank you. Amazing job. Was hard to understand the audio."}, {"username": "jervisfm", "parent_id": "6000557", "article_id": null, "id": "6000659", "comment": "Yeah, I have listened in on some air traffic controller streams that are available online and it's always hard to decipher what it is they are saying. It all sounds like words slurred together with no clear demarcation. I am mostly amazed how  pilots and the controllers clearly understand each speaking the way they do."}, {"username": "waster", "parent_id": "6000659", "article_id": null, "id": "6000700", "comment": "Also, kudos to the tower. It is seriously an amazing thing they do, and to stay cool and calm and efficient all during a crash, to keep the rest of the traffic clear and headed in the right direction."}, {"username": "bryanh", "parent_id": 0, "article_id": null, "id": "5999816", "comment": "High quality close up photo from https://path.com/p/1lwrZb:\n\nhttps://pathakacdn-a.akamaihd.net/photos2/f36a5729-6db7-40db-9c98-99aa8b68df4c/original.jpg"}, {"username": "Osmium", "parent_id": "5999816", "article_id": null, "id": "5999889", "comment": "I can't imagine the confusion that must have gone on when that happened, maybe it's shock or maybe people just underestimate the severity of their situation but correct me if I'm wrong... are there people in that photo actually carrying their bags off the plane? I can't quite comprehend that."}, {"username": "jedbrown", "parent_id": "5999889", "article_id": null, "id": "6000265", "comment": "\"\"\"\nThe majority of passengers who replied to the Safety Boardâ\u0080\u0099s questionnaire were carrying at least one piece of carry-on luggage. Only 25 passengers (6 percent) reported having no bags with them in the cabin. Of the 419 passengers who reported that they carried on bags, 208 (nearly 50 percent) reported attempting to remove a bag during their evacuation. The primary reason that passengers stated for grabbing their bags was for money, wallet, or credit cards (111 passengers). Other reasons included job items (65), keys (61), and medicines (51). Most passengers exited the airplane with their bags.\n\nPassengers exiting with carry-on baggage were the most frequently cited obstruction to evacuation. Twenty-four of the 36 flight attendants who responded listed carry-on baggage as an obstruction. Overall, 37 percent of the passengers indicated that retrieving carry-on baggage slowed the evacuation; however, in five of the evacuations (cases 9, 16, 24, 27, and 32), a majority of passengers believed that the evacuation was slowed by carry-on baggage. Further, 70 passengers and 8 flight attendants reported arguments between passengers and flight attendants regarding luggage.\n\n[...] The Safety Board concludes that passengersâ\u0080\u0099 efforts to evacuate an airplane with their carry-on baggage continue to pose a problem for flight attendants and are a serious risk to a successful evacuation of an airplane.\n\"\"\"\n\nhttp://www.ntsb.gov/doclib/safetystudies/SS0001.pdf (page 66-68)"}, {"username": "jellicle", "parent_id": "6000265", "article_id": null, "id": "6000525", "comment": "It's an obvious tragedy of the commons problem.  Everyone would get off fastest if they brought no bags.  But taking YOUR bag only slows down debarking a tiny amount, and it saves you weeks of hassle.  Clearly the rational choice is to bring your bag.  But when everyone brings their bag, possibly half the flight dies due to smoke inhalation from not getting off the plane quickly.  But even then, it's STILL the right choice to bring your bag.  Your exit speed is determined by whether everyone else brings their bag, a choice which you cannot affect.\n\nThe people who brought their bags off the plane today have their clothes, laptops and passports tonight; they can go to work tomorrow.  The people who didn't are locked up in a customs holding cell, wearing the same underwear, for a few days until someone can issue them a passport.  They'll never get their bag back and the airline will, after filing dozens of forms, compensate them about $50 for it."}, {"username": "sneak", "parent_id": "6000525", "article_id": null, "id": "6000822", "comment": "Electronic locks that lock all overhead compartments whenever the seatbelt sign is on, with clear LED indication and preflight explanation so people know their bags are inaccessible and simply don't try."}, {"username": "jonknee", "parent_id": "6000822", "article_id": null, "id": "6000924", "comment": "Many of the bags look like ones that would be under a seat. That's the one I would snag too--laptop and camera."}, {"username": "_delirium", "parent_id": "6000525", "article_id": null, "id": "6000537", "comment": "One obvious improvement, if your analysis is correct, is to apply some kind of more-sane treatment to undocumented immigrants who are undocumented due to an obviously anomalous situation, such as surviving a plane crash. If people really believe that the U.S. will treat them well if they do the right thing, they may be more inclined to do the right thing."}, {"username": "jzwinck", "parent_id": "6000537", "article_id": null, "id": "6000780", "comment": "The US regulations already contain provisions for this.  You needn't worry that the people who lost their passport in a plane crash will be treated inhumanely.  They may be inconvenienced in terms of lost time, but at least they didn't die in a fire."}, {"username": "randomknowledge", "parent_id": "6000265", "article_id": null, "id": "6000833", "comment": "I guess the take away is that you should keep your essentials on your person while flying. Those items list are all small enough to fit in pockets or unobtrusive bag. Having them ready sure make things go a lot smoother in an emergency situation.\n\nI suppose the emergency info should mention that anything you absolutely can't leave needs to be kept on your person.\n\nOf course most people will thing \"aw it will never happen\", but if they hear the same message every time they take off people will probably get in the habit of not leaving their wallets in their luggage."}, {"username": "Someone", "parent_id": "5999889", "article_id": null, "id": "6000119", "comment": "Apparently, it is fairly normal behavior; people activate a \"leave plane\" program. Having only one, they pick the one involving grabbing one's luggage before getting out of the plane.\n\n(Sorry, can't find a reference. Most hits I get are either on emergency reaction/response by outside teams or on long-term emergency responses such as PTSD, community reactions, etc)"}, {"username": "mikeash", "parent_id": "6000119", "article_id": null, "id": "6000219", "comment": "We do whatever we're used to.\n\nI fly gliders, where it's fairly common to wear parachutes in flight to guard against structural failure or mid-air collision.\n\nWe're told that when we're done flying, we should always exit the glider *first*, then remove the parachute. Some people will unbuckle the parachute first, then step out. Some of these people have gone on to bail out in flight, and they undo their seat belts, unbuckle their parachute, and then bail out of the plane without it."}, {"username": "Someone", "parent_id": "6000219", "article_id": null, "id": "6000280", "comment": "In indoor climbing arenas, people operating the safety line may unbuckle it seeing their regular partner land safely on the floor, even if they aren't securing their regular partner at that particular moment. Here, the recommended procedure is to always have the one who was climbing release the security line."}, {"username": "bane", "parent_id": "6000119", "article_id": null, "id": "6000167", "comment": "I remember seeing a car accident once, a young guy in a mustang T-Boned a mini-van driven by a mother with an infant passenger. A moment after the accident, the woman got out of the minivan, walked around to the other side to open the working side door, grabbed her purse, and then calmly walked to the shoulder to wait for police. It was only after anybody asked her if there was anybody else in the vehicle that she realized her infant was still in the van, right next to where her purse had been. She ran over, retrieved her child and then went back to the curb, cursing herself the entire way.\n\n(everybody was fine, there were no injuries)."}, {"username": "daeken", "parent_id": "6000167", "article_id": null, "id": "6000372", "comment": "I was in a very, very bad accident at 16.  I pulled myself out by the steering wheel (I was in the front passenger seat) and walked over to the other vehicle to ask if everyone was okay, before finding out that I was severely injured myself.  The other driver kept telling me I should really sit down, and I couldn't comprehend why he'd be saying that when I felt perfectly fine.\n\nThe brain is quite incredible at blocking out bad things."}, {"username": "ddunkin", "parent_id": "6000119", "article_id": null, "id": "6000426", "comment": "What they need is a giant sliding bar (like in old jail cells) that locks the overhead doors shut on takeoff, and won't get released until at the gate. Last time I flew on a commercial flight, I got clocked in the head by some jerk who couldn't think ahead and put 'something important' in the overhead.\n\nI think it would be fair to carry the small package under my seat (my laptop), but reaching for overhead is a joke."}, {"username": "justin66", "parent_id": "5999889", "article_id": null, "id": "5999994", "comment": "The bottlenecks in their escape were the doorway and the crew's deployment of the inflatable slide. Rushing the door in a panic would have done nobody any good.\n\nIn a situation like that, why wouldn't you grab your bag if it was readily accessible? It seems like healthy, rational behavior rather than a symptom of extreme confusion."}, {"username": "sbierwagen", "parent_id": "5999994", "article_id": null, "id": "6000247", "comment": "The bottlenecks in their escape were the doorway and the \n  crew's deployment of the inflatable slide... why wouldn't \n  you grab your bag if it was readily accessible?\n\nWrong. In order to be certified airworthy, you have to be able to evacuate an airliner in 90 seconds, in the dark, with some of the emergency exits blocked. Here's an A380 doing it:http://www.youtube.com/watch?v=4TAkAcQOnQY\n\nHere's a 777: http://www.youtube.com/watch?v=4TAkAcQOnQY\n\nIf everyone stops to grab their bag, it can take ten times as long. If the plane is on fire, then people die."}, {"username": "justin66", "parent_id": "6000247", "article_id": null, "id": "6000394", "comment": "Thanks. That is impressive.\n\nThe whole thing now makes me wonder if there was some very deliberate reason for their egress to be delayed. Something having to do with fire or the risk of fire? (I really have no idea)"}, {"username": "blake8086", "parent_id": "6000247", "article_id": null, "id": "6000617", "comment": "You linked the same video twice. (thanks, though)"}, {"username": "Osmium", "parent_id": "5999994", "article_id": null, "id": "6000074", "comment": "> Rushing the door in a panic would have done nobody any good.\n\nNo one's suggesting this. You can both leave the plane in a calm manner *and* leave your bags behind. As far as I'm concerned, there's no good reason to take your bag unless it's actively obstructing the way out -- which, in fairness, could well be what's happened here.\n\nOff-hand, some reasons not to: the aisles have limited capacity, and more bags in the aisles mean fewer people can be queueing ready to get off. It will take longer to figure out how to use the slide if you want to go down it with your bag, especially if the bag is heavy or large. The bag might have sharp corners which could damage the slide (if I remember rightly, people are advised to remove sharp-heeled shoes for this reason).\n\nSeconds count in situations like this. I think people have taken the \"keep calm\" message to heart and, if anything, need to be taught to treat this kind of thing more seriously. The reason I mention this is that I'm reminded of the bystander effect:\n\nhttp://en.wikipedia.org/wiki/Bystander_effect#Emergency_versus_non-emergency_situations\n\ne.g.\n\n> The students were placed in a room-either alone, with two strangers or with three strangers to complete a questionnaire while they waited for the experimenter to return. While they were completing the questionnaire smoke was pumped into the room through a wall vent to simulate an emergency. When students were working alone they noticed the smoke almost immediately (within 5 seconds). However, students that were working in groups took longer (up to 20 seconds) to notice the smoke.\n\nThese peoples lives could have been in imminent danger, but they might waste precious seconds to leaving the plane because of social pressures (e.g. someone sees one person taking their bag, so thinks it's okay to do so themselves, or subconsciously thinks the situation is not that serious).\n\nPeople should keep calm, but they should also know to treat the situation as it is -- an emergency. But as I say, this is all speculation, and may not be relevant at all in this specific instance. I just hope everyone's okay."}, {"username": "justin66", "parent_id": "6000074", "article_id": null, "id": "6000157", "comment": "> Off-hand, some reasons not to: the aisles have limited capacity, and more bags in the aisles mean fewer people can be queueing ready to get off.\n\nI can see what you're saying but \"number of people queued in the aisles\" isn't an important measurement at all. The important thing would how much the overall rate of passage through the exits is affected by the people who grabbed their bags.\n\nI expect the rate of passage through those exits has a lot to do with what people do when they reach the bottom of the slide. That certainly might be affected by what they're carrying, but then again, people might have simply been tossing their bags over the side. You can't rely too heavily on a single photograph to analyse these things.\n\n> I think people have taken the \"keep calm\" message to heart and, if anything, need to be taught to treat this kind of thing more seriously.\n\nThe alternatives are to keep calm or panic. I guess \"seriousness\" is subjective but when it comes to calmness vs. panic, I know which alternative I'd prefer the people around me to exhibit in an emergency. Particularly in a confined space. How is this even an argument?"}, {"username": "justin66", "parent_id": "6000074", "article_id": null, "id": "6000666", "comment": "After seeing the following photograph (1 of 18) I'm confused. Contrast it with the original one we were talking about:\nhttp://www.chicagotribune.com/news/chi-san-francisco-plane-crash-20130706,0,284092.story\n\nNever mind the whole issue of people grabbing their bags. That plane was rather seriously on fire and the people in the original photograph don't appear to be very concerned about moving away from it. Strange."}, {"username": "lifeformed", "parent_id": "5999994", "article_id": null, "id": "6000239", "comment": "A lot of plane crash deaths happen after the crash - burning fuel can spread quickly and kill or incapacitate people inside.  Every second counts.  Even if you already have your bag in hand, you're leaving less room for others in the aisle."}, {"username": "bane", "parent_id": "5999994", "article_id": null, "id": "6000168", "comment": "Also, since it's an international flight, people's travel papers are likely in their backpacks, etc. If you take the time to grab your backpack, you may as well grab whatever else before you head out."}, {"username": "aylons", "parent_id": "6000168", "article_id": null, "id": "6000353", "comment": "I wonder if they refuse ingress to the USA based on lack of documentation in these cases."}, {"username": "vilhelm_s", "parent_id": "5999994", "article_id": null, "id": "6000070", "comment": "The safety briefing before every flight tells you not take take any bags when emergency evacuating the plane."}, {"username": "VladRussian2", "parent_id": "6000070", "article_id": null, "id": "6000214", "comment": "it is interesting how emergency this emergency situation is - the people are being let out only through one door, and they aren't additionally channeled through business class door even though business class people have obviously already left, and there seems to be no damage to the plane blocking the economy to business class passageway. The emergency exit atop the wing is also not activated. I mean it seems that it isn't that big of an emergency from POV of the people inside the plane."}, {"username": "rossjudson", "parent_id": "5999889", "article_id": null, "id": "6000366", "comment": "If you're in a plane crash, you're trying to evacuate, and the guy ahead of you is trying to grab his carry-on and the bottles of wine he bought in France before exiting, I am pretty sure it's perfectly OK to punch him in the face."}, {"username": "paul_f", "parent_id": "6000366", "article_id": null, "id": "6000573", "comment": "No jury in the world ..."}, {"username": "jeremymcanally", "parent_id": "5999889", "article_id": null, "id": "5999997", "comment": "They probably instructed you to take their carry ons.  Otherwise, given it was a flight from Korea, they may not speak English and have no clue what they were being told to do."}, {"username": "mng2", "parent_id": "5999997", "article_id": null, "id": "6000047", "comment": "It's a Korean airline, so the crew members are probably able to speak both Korean and English."}, {"username": "51Cards", "parent_id": "5999816", "article_id": null, "id": "5999859", "comment": "What a phenomenal photo and speed of information.  People are still exiting with their bags in hand, incredible.  THIS is one of those moments when you realize how social media and mobile devices have changed the world."}, {"username": "bfung", "parent_id": 0, "article_id": null, "id": "6000160", "comment": "I know this is exciting news and all, but:\n\nhttp://ycombinator.com/newsguidelines.html\n\nHacker News Guidelines\n\nWhat to Submit\nOn-Topic:\n\nAnything that good hackers would find interesting.\n\nThat includes more than hacking and startups.\n\nIf you had to reduce it to a sentence, the answer might be: anything that gratifies one's intellectual curiosity.\n\nOff-Topic:\n\nMost stories about politics, or crime, or sports, unless they're evidence of some interesting new phenomenon.\n\nVideos of pratfalls or disasters, or cute animal pictures.\n\n*If they'd cover it on TV news*, it's probably off-topic.\n\nI'd say trying to rationalize that this story is relevant on HN by saying \"startups use SFO\" is a stretch.  I'd hope that people taking flights out actually check with the airport first before checking HN."}, {"username": "zhoutong", "parent_id": "6000160", "article_id": null, "id": "6000221", "comment": "FWIW, I was in the airport waiting for my flight to SFO, and I took out my laptop and found this on HN. The counter staff only informed passengers of the news one hour after the HN post."}, {"username": "foobarbazqux", "parent_id": "6000160", "article_id": null, "id": "6000469", "comment": "I also used to complain about off-topic submissions reaching the front page, but doing so is also against the guidelines, so it's better just to flag them and move on.  I know it seems like the flagging system is broken at times but I've been convinced that having arguments about it is just a waste of time."}, {"username": "joshuak", "parent_id": "6000160", "article_id": null, "id": "6000520", "comment": "In watching how this news has been better (i.e. more acuratly and faster, and also rapidly self correcting) reported on HN then any other news source I'd have to say that HN itself is the relevant on topic idea that good hackers would find interesting. I do.\n\nHN is better at news reporting and sifting. I'd like to know why and see if it could be reproduced for the larger public."}, {"username": "sliverstorm", "parent_id": "6000160", "article_id": null, "id": "6000316", "comment": "It's interesting in the context of the issues with the 787, which HN has shown plenty of interest in.\n\nIt could have nothing to do with the 787, but show me lots of articles about the 787 and I'm going to be tangentially interested in the 777.\n\nIt is also interesting in the context of HN when you think of the people who talk about how airlines need to be disrupted. It serves as a reminder of the stakes- you can't necessarily jump into the airlines business shooting from the hip and hoping for the best."}, {"username": "tankenmate", "parent_id": "6000160", "article_id": null, "id": "6000297", "comment": "From what I saw it impacted before the runway. This brings back memories of the British Airways 777 that came down early due to loss of power to both engines (Speedbird 38, Beijing to London). The cause of that was ice blocking the fuel filters which starved both engines. The thing to check here was what altitude the plane was flying at for most of the flight, and what temperature it was at that altitude along the flight path."}, {"username": "markdown", "parent_id": "6000297", "article_id": null, "id": "6000337", "comment": "That icing issue has since been fixed and so is irrelevant to this crash (according to CNN)."}, {"username": "adrinavarro", "parent_id": "6000160", "article_id": null, "id": "6000449", "comment": "I believe it is interesting, because accidents such as this one imply a thorough investigation. That is: figure out what went wrong, why and how, and how it can be avoided in the future (and, unlike some people believe, it's never about blaming or suing anyone).\n\nThat sounds quite hacker-ish to me. It's all about learning to understand facts, understand information and events; and then obtain conclusions and analyze them (when they are released)."}, {"username": "alan_cx", "parent_id": "6000160", "article_id": null, "id": "6000623", "comment": "\"anything that gratifies one's intellectual curiosity.\"\n\nNo?"}]